# ¿Qué es un DataFrame?

In [ ]:
--Es una estructura de datos con dos dimensiones en la cual se puede guardar datos de distintos tipos ( como 
  caracteres, enteros, valores de punto flotante, factores y más), en columnas, de manera a como se realiza en una 
  hoja de cálculo.

# La librería PANDAS

In [ ]:
--PANDAS es una librería de Python especializada en el manejo y análisis de estructuras de datos.
--Las principales características de esta librería son:
    
    **Permite leer y escribir fácilmente ficherosen formato CSV, Excel y bases de datos SQL.
    **Ofrece métodos para reordenar, dividir y combinar conjuntos de datos de manera muy eficiente.

# La librería NumPy

In [ ]:
--NumPy es una librería de Python especializada en el cálculo numérico y el análisis de datos, especialmente para un gran 
  volumen de datos.
--Incorpora una nueva clase de objetos llamados "arrays" (arreglos) que permite representar colecciones de datos de un 
  mismo tipo en varias dimensiones, y funciones muy eficientes para su manipulación.

# ejercicio

In [ ]:
mediante el uso de las librerías NumPy y Pandas desarrolle un código en Python que sea capaz de generar el siguiente
DataFrame:

# Creación de un arreglo

In [2]:
# Importación de la libreria numpy
import numpy

# Creación de un ARREGLO
arreglo = numpy.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [ ]:
## me salió este error No module named 'numpy'     lo corregí  con pip install numpy
##  instalandolo en cmd

# asignar un alias a numpy

In [3]:
import numpy as np
arreglo = np.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

# Creación de un DataFrame

In [5]:
# DataFrame es lo mismo que formato tabular

import pandas as pd

#Creación de un Dataframe
df = pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
## me salió este error No module named 'pandas'     lo corregí  con pip install pandas
##  instalandolo en cmd

# Darle nombre a las columnas del DataFrame

In [9]:
df = pd.DataFrame(data = arreglo, index = ['A','B','C'], columns = ['D','E','F'])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

# Extraer algunos elementos del DataFrame

In [8]:
df.head(2)                       # extraer registros o renglones (filas)

   D  E  F
A  1  2  3
B  4  5  6

# Información de cada columna

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int32
 1   E       3 non-null      int32
 2   F       3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

# Dimensión del DataFrame

In [11]:
df.shape                                # nos dice el número de filas y columnas del DataFrame

(3, 3)

# Cálculo de estadísticas generales de la tabla

In [12]:
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

# Nombres de las columnas

In [13]:
df.columns

Index(['D', 'E', 'F'], dtype='object')

# Nombres de los renglones

In [14]:
df.index

Index(['A', 'B', 'C'], dtype='object')

# Adición de un nuevo renglón al DataFrame

In [15]:
df.loc['G'] = [11,12,13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

# Adición de una nueva columna al DataFrame

In [16]:
df["H"] = [17,16,15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

# Extracción de columnas del DataFrame

In [17]:
df2 = df[["E","H"]]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

# Extracción de renglones del DataFrame

In [19]:
df3 = df.iloc[0:2]                   #Extrae los primeros dos renglones
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

# Cambio de nombre en TODAS las columnas

In [20]:
df.columns = ['Columna1','Columna2','Columna3','Columna4']
df

   Columna1  Columna2  Columna3  Columna4
A         1         2         3        17
B         4         5         6        16
C         7         8         9        15
G        11        12        13        14

# Cambio de nombre de ALGUNAS columnas

In [21]:
df.rename(columns = {'Columna1' : 'Column1', 'Columna2' : 'Column2'}, inplace = True)
df

   Column1  Column2  Columna3  Columna4
A        1        2         3        17
B        4        5         6        16
C        7        8         9        15
G       11       12        13        14

# Cambio de nombre de ALGUNOS renglones

In [22]:
df.rename(index = {"A" : "Dato1", "B" : "Dato2"}, inplace = True)
df

       Column1  Column2  Columna3  Columna4
Dato1        1        2         3        17
Dato2        4        5         6        16
C            7        8         9        15
G           11       12        13        14

# Ordenamiento de DataFrames

In [23]:
df4 = df.sort_values("Columna4", ascending = True)
df4

       Column1  Column2  Columna3  Columna4
G           11       12        13        14
C            7        8         9        15
Dato2        4        5         6        16
Dato1        1        2         3        17

# Verificación de condiciones en DataFrames

In [24]:
df["Column2"] > 5

Dato1    False
Dato2    False
C         True
G         True
Name: Column2, dtype: bool

In [25]:
# Extre los renglones que cumplen con la condición

df[df["Column2"] > 5]

   Column1  Column2  Columna3  Columna4
C        7        8         9        15
G       11       12        13        14

# Condiciones Múltiples

In [26]:
condicion1 = df["Column1"] > 1
condicion2 = df["Column2"] < 12
df[condicion1 & condicion2]

       Column1  Column2  Columna3  Columna4
Dato2        4        5         6        16
C            7        8         9        15

In [27]:
df

       Column1  Column2  Columna3  Columna4
Dato1        1        2         3        17
Dato2        4        5         6        16
C            7        8         9        15
G           11       12        13        14

# ejercicio

In [28]:
arreglo = np.array([['Bella', 'Labrador', 'Café', 56, 24,  '2013-07-01'],
                   ['Charlie', 'Poodle', 'Negro', 43, 24,  '2016-09-16'],
                   ['Lucy', 'Chow Chow', 'Café', 46, 24,  '2014-08-25' ],
                   ['Cooper', 'Schnauzer', 'Gris', 49, 17, '2011-12-11'],
                   ['Bernie','San Bernardo','Blanco',77,74,'2018-02-27']])
arreglo

array([['Bella', 'Labrador', 'Café', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27']],
      dtype='<U12')

In [29]:
df = pd.DataFrame(data = arreglo, columns = ['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_Nac'])
df

    Nombre          Raza   Color Altura_cm Peso_kg   Fecha_Nac
0    Bella      Labrador    Café        56      24  2013-07-01
1  Charlie        Poodle   Negro        43      24  2016-09-16
2     Lucy     Chow Chow    Café        46      24  2014-08-25
3   Cooper     Schnauzer    Gris        49      17  2011-12-11
4   Bernie  San Bernardo  Blanco        77      74  2018-02-27

# 1) Extraiga aquellos registros de los perros cuya fecha de nacimiento es anterior al 1 de Enero de 2015

In [31]:
df2 = df[df['Fecha_Nac'] < '2015-01-01']
df2

   Nombre       Raza Color Altura_cm Peso_kg   Fecha_Nac
0   Bella   Labrador  Café        56      24  2013-07-01
2    Lucy  Chow Chow  Café        46      24  2014-08-25
3  Cooper  Schnauzer  Gris        49      17  2011-12-11

# 2) Extraiga aquellos registros de los perros cuya estatura es mayor a 50 cms.

In [33]:
df['Altura_cm'] = df['Altura_cm'].astype(int)        # convierte de tipo texto a tipo entero.

In [34]:
df[df['Altura_cm'] > 50]

   Nombre          Raza   Color  Altura_cm Peso_kg   Fecha_Nac
0   Bella      Labrador    Café         56      24  2013-07-01
4  Bernie  San Bernardo  Blanco         77      74  2018-02-27

# 3) Agregue una nueva columna a este DataFrame que calcule el índice de masa muscular  (IMM) para cada perro, el cual está dado por la fórmula:                                 IMM = (Peso en Kgs.) / (Altura en Metros)**2

In [35]:
df['Peso_kg'] = df['Peso_kg'].astype(int)                 # convierte de tipo texto a tipo entero.
               
df['IMM'] = df['Peso_kg'] / (df['Altura_cm'] / 100) **2
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac         IMM
0    Bella      Labrador    Café         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow Chow    Café         46       24  2014-08-25  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

# Otras manipulaciones:    Extracción de las columnas: Nombre, Raza e IMM

In [36]:
df2 = df[['Nombre', 'Raza', 'IMM']]
df2

    Nombre          Raza         IMM
0    Bella      Labrador   76.530612
1  Charlie        Poodle  129.799892
2     Lucy     Chow Chow  113.421550
3   Cooper     Schnauzer   70.803832
4   Bernie  San Bernardo  124.810255

# Ordenando en base al índice de masa muscular (IMM)

In [37]:
df2 = df2.sort_values("IMM", ascending = True)
df2

    Nombre          Raza         IMM
3   Cooper     Schnauzer   70.803832
0    Bella      Labrador   76.530612
2     Lucy     Chow Chow  113.421550
4   Bernie  San Bernardo  124.810255
1  Charlie        Poodle  129.799892